{
  "profile": {
    "name": "Austin Klein",
    "birth_date": "1994-09-03",
    "biography": "My name is Austin Klein. I am currently an undergraduate student at the Rochester Institute of Technology. I expect to graduate in the spring of 2017 with a BS in Software Engineering. In addition to completing my coursework, I have completed three co-op blocks where I worked full time (40 hour work weeks) developing and testing software. While I am a full stack developer with a year of work experience in the field, lately I have been working mostly on the front-end.",
    "location": "Rochester, NY"
  },
  "contact_details": {
    "email": "amk5401@rit.edu",
    "linkedin": "https://www.linkedin.com/in/austin-klein-82429481",
    "facebook": "https://www.facebook.com/austin.klein.14/",
    "github": "https://github.com/amk5401/"
  },
  "careers": [
    {
      "title": "EagleDream Technologies",
      "specification": "Software Engineering Co-op",
      "description": "During my second co-op I worked on a number of software projects, at times from conception to completion. We were in charge of testing our own deliverables in order to assure they fit the requirements. I was also able to work with a number of different technologies many of which were new to me.",
      "start_date": "Sep 2015",
      "end_date": "Jan 2016",
      "link": "http://www.eagledream.com/"
    },
    {
      "title": "Soleo Communications",
      "specification": "Quality Assurance Engineering Co-op",
      "description": "My first co-op while attending RIT allowed me to own the entire quality assurance process and quality of the product. I developed Selenium test scripts and automated testing plans as well as participated in design reviews and planning meetings. This gave me a chance to learn what the 'real world' of Software Engineering was like and cement my interest in the field.",
      "start_date": "June 2014",
      "end_date": "Dec 2014",
      "link": "http://www.soleo.com/"
    },
    {
      "title": "Crellin Park",
      "specification": "Head Camp Counselor",
      "description": "I worked for 4 years as a camp counselor in Upstate NY for the Town of Chatham, Recreation Department. As a counselor, I would arrange a safe and fun environment for kids to play and learn through games and programs. In 2012, I became a head counselor. In addition to managing a group of children, I also oversaw junior counselor's activities to ensure proper work ethic. It was the goal of our Recreation Department to provide diverse activities for the children to produce a well-rounded experience.",
      "start_date": "Summers of 2009",
      "end_date": "2012",
      "link": "http://crellinpark.org/"
    },
    {
      "title": "Jiminy Peak Mountain Resort",
      "specification": "Ski Instructor",
      "description": "I got my first job as soon as I turned 14 and was legally allowed to work. At Jiminy Peak, I learned how to communicate effectively with individuals, whether the individual was my supervisor, a parent, or a three year-old. As an instructor, I taught five hour ski lessons to children aged three through twelve. Their skill levels varied from beginner to expert.",
      "start_date": "Winters of 2008",
      "end_date": "2011",
      "link": "http://www.jiminypeak.com/"
    }
  ],
  "educations": [
    {
      "title": "Rochester Institute of Technology",
      "specification": "Bachelor of Science - Software Engineering",
      "description": "This university offered a fantastic co-op program which helped me get over a year of full time experience at a few different companies before I even graduated. While attending RIT I was part of the Varsity Crew for a few years, took classes in a range of subjects, and was able to figure out what I wanted to get out of a full-time job.",
      "start_date": "Sep 2012",
      "end_date": "May 2017 (Expected)",
      "link": "http://www.rit.edu/"
    },
    {
      "title": "Chatham Highschool",
      "specification": "Highschool Diploma",
      "description": "During highschool I was an active member of the Varisty Tennis and Varisty Cross Country teams. I also enjoyed music and played multiple instruments while being a part of both the concert and marching bands. I took two computer science classes which gave me my first taste of the field.",
      "start_date": "Sep 2008",
      "end_date": "Jun 2012",
      "link": "http://www.chathamcentralschools.com/"
    }
  ],
  "classes": [
    {
      "title": "Computer Science 1,2,3",
      "level": 5
    },
    {
      "title": "Professional Communication",
      "level": 5
    },
    {
      "title": "Engineering of Software Subsystems",
      "level": 5
    },
    {
      "title": "Engineering Fundamentals of Computer Systems",
      "level": 5
    },
    {
      "title": "Calculus 1,2,3",
      "level": 5
    },
    {
      "title": "University Physics 1,2",
      "level": 5
    },
    {
      "title": "SW Process and Project Management",
      "level": 5
    },
    {
      "title": "Engineering Secure Software",
      "level": 5
    }
  ],
  "technical_skills": [
    {
      "title": "Java, Javascript, HTML, CSS, C#, Python",
      "level": 5,
      "type":  "Languages"
    },
    {
      "title": "Bootstrap, AngularJS, Django",
      "level": 5,
      "type":  "Frameworks"
    },
    {
      "title": "Eclipse IDE, Visual Studio, Git",
      "level": 5,
      "type":  "Other"
    }
  ],
  "projects": [
    {
      "title": "Personal Website",
      "description": "This personal website was created to document my growth in the professional world. It was created using AngularJS, Bootstrap, CSS, and HTML. A JSON file stores most of the personal details which allows for easy updating and easy reuse of the code for other users.",
      "technologies": "AngularJS, Bootstrap, CSS, HTML",
      "image": "Personal_Website.png",
      "link": "https://github.com/amk5401/amk5401.github.io"
    },
    {
      "title": "Tool Share",
      "description": "A community tool sharing website built using Python, Bootstrap, and the Django web framework. Completed for a class while attending RIT.",
      "technologies": "Bootstrap, Python, Django",
      "image": "ToolShare_Home_Page.png",
      "link": "https://github.com/jcdesimp/SEToolShare"
    },
    {
      "title": "Skyscraper",
      "description": "This is a fun little backtracking solver for the Skyscraper puzzle done in one of my first semesters at RIT. It was written in Python.",
      "technologies": "Python",
      "image": "Skyscraper_Output.png",
      "link": "http://austin-klein.com/assets/images/Skyscraper_Code.png"
    }
  ]
}
