{
  "profile": {
    "name": "Austin Klein",
    "birth_date": "1994-09-03",
    "biography": "My name is Austin Klein. I am a Software Engineer who has been working as a full stack developer for the last 5 years. I have contributed to business critical applications and high value division wide initiatives. I have organized multiple modernization efforts on my dev team, and taught teammates new skills when they were new to a technology. In my free time I also enjoy building with my hands, along with many outdoor activities such as rowing, skiing, and biking.",
    "location": "King of Prussia, PA"
  },
  "contact_details": {
    "email": "austin.klein.se@gmail.com",
    "linkedin": "https://www.linkedin.com/in/austin-klein-82429481",
    "facebook": "https://www.facebook.com/austin.klein.14/",
    "github": "https://github.com/amk5401/"
  },
  "careers": [
    {
      "title": "Vanguard",
      "specification": "Application Engineer",
      "description": "During this time I held three development roles. I started as a Dev I out of college and was then promoted twice and given the Distinguished merit rating twice, both within 5 years. For the majority of this time I was a full stack developer and would work on the UI, Service, Batch jobs, along with database queries.",
      "start_date": "Jun 2017",
      "end_date": "Current",
      "link": "https://investor.vanguard.com/corporate-portal/"
    },
    {
      "title": "EagleDream Technologies",
      "specification": "Software Engineering Co-op",
      "description": "During my second co-op I worked on a number of software projects, at times from conception to completion. I was in charge of testing my own deliverables in order to assure they fit the requirements. I was also able to work with a number of different technologies many of which were new to me.",
      "start_date": "Sep 2015",
      "end_date": "Jan 2016",
      "link": "https://www.pwc.com/us/en/about-us/newsroom/press-releases/pwc-acquires-eagledream-technologies.html"
    },
    {
      "title": "Soleo Communications",
      "specification": "Quality Assurance Engineering Co-op",
      "description": "My first co-op while attending RIT allowed me to own the entire quality assurance process and quality of the product. I developed Selenium test scripts and automated testing plans as well as participated in design reviews and planning meetings. This gave me a chance to learn what the 'real world' of Software Engineering was like and cement my interest in the field.",
      "start_date": "June 2014",
      "end_date": "Dec 2014",
      "link": "https://soleo.com/"
    },
    {
      "title": "Crellin Park",
      "specification": "Head Camp Counselor",
      "description": "I worked as a camp counselor in Upstate NY for the Town of Chatham, Recreation Department. As a counselor, I would arrange a safe and fun environment for kids to play and learn through games and programs. In 2012, I became a head counselor. In addition to managing a group of children, I also oversaw junior counselor's activities to ensure proper work ethic. It was the goal of our Recreation Department to provide diverse activities for the children to produce a well-rounded experience.",
      "start_date": "Summers of 2009",
      "end_date": "2012",
      "link": "http://crellinpark.org/"
    },
    {
      "title": "Jiminy Peak Mountain Resort",
      "specification": "Ski Instructor",
      "description": "I got my first job as soon as I turned 14 and was legally allowed to work. At Jiminy Peak, I learned how to communicate effectively with individuals, whether the individual was my supervisor, a parent, or a three year-old. As an instructor, I taught five hour ski lessons to children aged three through twelve. Their skill levels varied from beginner to expert.",
      "start_date": "Winters of 2008",
      "end_date": "2011",
      "link": "https://www.jiminypeak.com/"
    }
  ],
  "educations": [
    {
      "title": "Rochester Institute of Technology",
      "specification": "Bachelor of Science - Software Engineering",
      "description": "This university offered a fantastic co-op program which helped me get over a year of full time experience at a few different companies before I even graduated. While attending RIT I was part of the Varsity Crew for a few years, took classes in a range of subjects, and was able to figure out what I wanted to get out of a full-time job.",
      "start_date": "Sep 2012",
      "end_date": "May 2017",
      "link": "https://www.rit.edu/"
    },
    {
      "title": "Chatham Highschool",
      "specification": "Highschool Diploma",
      "description": "During highschool I was an active member of the Varisty Tennis and Varisty Cross Country teams. I also enjoyed music and played multiple instruments in both the concert and marching bands. I took two computer science classes which gave me my first taste of the field.",
      "start_date": "Sep 2008",
      "end_date": "Jun 2012",
      "link": "https://www.chathamcentralschools.com/"
    }
  ],
  "technical_skills": [
    {
      "title": "Java, Javascript, Typescript, Python",
      "level": 5,
      "type":  "Languages"
    },
    {
      "title": "Spring Boot, Angular 2+, AngularJS",
      "level": 5,
      "type":  "Frameworks"
    },
    {
      "title": "ECS, S3, RDS, DMS, Athena, Lambda",
      "level": 5,
      "type":  "AWS Cloud"
    },
    {
      "title": "PSQL, Oracle, Selenium, HTML, CSS",
      "level": 5,
      "type":  "Other"
    }
  ],
  "projects": [
    {
      "title": "Personal Website",
      "description": "This personal website was created to document my growth in the professional world. It was created using AngularJS, Bootstrap, CSS, and HTML. A JSON file stores most of the personal details which allows for easy updating and easy reuse of the code for other users.",
      "technologies": "AngularJS, Bootstrap, CSS, HTML",
      "image": "Personal_Website.png",
      "link": "https://github.com/amk5401/amk5401.github.io"
    },
    {
      "title": "Smart Mirror",
      "description": "I made a raspberry pi hosted local website that is displayed on a monitor behind one-way glass. It auto updates weather, traffic, news, and a daily comic from different free API's.",
      "technologies": "Raspbian, Javascript, CSS, HTML",
      "image": "SmartMirror_1.jpg",
      "link": "http://austin-klein.com/assets/images/SmartMirror_2.png"
    },
    {
      "title": "Chat Project",
      "description": "I updated most of the pages facing the public while on my second co-op at EagleDream. The main functionality was completed by another employee. This site is also using AngularJS and Bootstrap.",
      "technologies": "AngularJS, Bootstrap",
      "image": "ChatPlat.png",
      "link": "http://austin-klein.com/assets/images/Chat_Project.png"
    },
    {
      "title": "Skoolie Build",
      "description": "This is my 40 foot School Bus that I am renovating into a Motorhome. I am learning each skill as I get there and am currently starting to insulate and frame the interior.",
      "technologies": "Woodworking, Plumbing, Electrical, Youtube??",
      "image": "Skoolie_1.jpg",
      "link": "http://austin-klein.com/assets/images/Skoolie_2.png"
    }
  ]
}
